var data={
    "table": [
        {"year":"1573" ,"A":"明" ,"B":"萬曆"},
        {"year":"1620" ,"A":"明" ,"B":"泰昌"},
        {"year":"1621" ,"A":"明" ,"B":"天啟"},
        {"year":"1628" ,"A":"明" ,"B":"崇禎"},
        {"year":"1644" ,"A":"清" ,"B":"順治"},
        {"year":"1662" ,"A":"清" ,"B":"康熙"},
        {"year":"1723" ,"A":"清" ,"B":"雍正"},
        {"year":"1736" ,"A":"清" ,"B":"乾隆"},
        {"year":"1796" ,"A":"清" ,"B":"嘉慶"},
        {"year":"1821" ,"A":"清" ,"B":"道光"},
        {"year":"1850" ,"A":"清" ,"B":"咸豐"},
        {"year":"1861" ,"A":"清" ,"B":"同治"},
        {"year":"1875" ,"A":"清" ,"B":"光緒"}

    ],
    "other":[
        {"year":"1624" ,"A":"荷西"},
        {"year":"1647" ,"A":"南明" ,"B":"永曆"},
        {"year":"1662" ,"A":"鄭氏" ,"B":"來台"}
        
    ]
}



function twYear(year){
    var A="";
    var B="";
    var C="";
    if((year>=1573)&&(year<1620)){
        var y = year-1573;
        if(y==0){
            A = "明萬曆元年";
        }
        else{
            A = "明萬曆"+(y+1)+"年";
        } 
    }
    if(year==1620){

        A = "明泰昌元年";
        
    }
    if((year>=1621)&&(year<1628)){
        var y = year-1621;
        if(y==0){
            A = "明天啟元年";
        }
        else{
            A = "明天啟"+(y+1)+"年";
        } 
        
    }
    if((year>=1628)&&(year<1644)){
        var y = year-1628;
        if(y==0){
            A = "明崇禎元年";
        }
        else{
            A = "明崇禎"+(y+1)+"年";
        } 
        
    }
    if((year>=1644)&&(year<1662)){
        var y = year-1644;
        if(y==0){
            A = "清順治元年";
        }
        else{
            A = "清順治"+(y+1)+"年";
        } 
        
    }
    if((year>=1662)&&(year<1723)){
        var y = year-1662;
        if(y==0){
            A = "清康熙元年";
        }
        else{
            A = "清康熙"+(y+1)+"年";
        } 
        
    }
    if((year>=1723)&&(year<1736)){
        var y = year-1723;
        if(y==0){
            A = "清雍正元年";
        }
        else{
            A = "清雍正"+(y+1)+"年";
        } 
        
    }
    if((year>=1736)&&(year<1796)){
        var y = year-1736;
        if(y==0){
            A = "清乾隆元年";
        }
        else{
            A = "清乾隆"+(y+1)+"年";
        } 
        
    }
    if((year>=1796)&&(year<1821)){
        var y = year-1796;
        if(y==0){
            A = "清嘉慶元年";
        }
        else{
            A = "清嘉慶"+(y+1)+"年";
        } 
        
    }
    if((year>=1821)&&(year<1850)){
        var y = year-1821;
        if(y==0){
            A = "清道光元年";
        }
        else{
            A = "清道光"+(y+1)+"年";
        } 
        
    }
    if((year>=1850)&&(year<1861)){
        var y = year-1850;
        if(y==0){
            A = "清咸豐元年";
        }
        else{
            A = "清咸豐"+(y+1)+"年";
        } 
        
    }
    if((year>=1861)&&(year<1875)){
        var y = year-1861;
        if(y==0){
            A = "清同治元年";
        }
        else{
            A = "清同治"+(y+1)+"年";
        } 
        
    }
    if((year>=1875)&&(year<1909)){
        var y = year-1875;
        if(y==0){
            A = "清光緒元年";
        }
        else{
            A = "清光緒"+(y+1)+"年";
        } 
        
    }

    
    if((year>=1624)&&(year<1662)){
        var y = year-1624+1;
        B="荷西統治"+y+"年";
      
    }
    if(year ==1645){
        C = "南明弘光";
    }
    if(year ==1646){
        C = "南明隆武";
    }

    if((year>=1647)&&(year<1683)){
        var y = year-1647;
        if(y==0){
            C = "南明永曆元年";
        }
        else{
            C = "南明永曆"+(y+1)+"年";
        }
    }

    if((year>=1662)&&(year<1683)){
        var y = year-1662;
        B="鄭氏統治"+(y+1)+"年";
    }

    var ans = A+"&nbsp;"+B+"&nbsp;"+C;
    return ans;


}